tutorials/multiphase/multiphaseEulerFoam/RAS/wallBoilingIATE/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    thermalPhaseChangeMultiphaseSystem;

phases (gas liquid);

gas
{
    type            purePhaseModel;
    diameterModel   IATE;

    IATECoeffs
    {
        dMax 1e-2;
        dMin 1e-4;
        residualAlpha 1e-4;

        sources
        (
            wakeEntrainmentCoalescence
            {
                Cwe         0.002;
            }

            randomCoalescence
            {
                Crc         0.04;
                C           3;
                alphaMax    0.75;
            }

            turbulentBreakUp
            {
                Cti         0.085;
                WeCr        6;
            }

            phaseChange
            {
                otherPhase  liquid;
                dmdtf       thermalPhaseChange:dmdtf;
            }

            wallBoiling
            {}
        );
    }

    constantCoeffs
    {
        d               0.00045;
    }

    residualAlpha   1e-6;
}

liquid
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               0.00045;
    }
    Sc              0.7;

    residualAlpha   1e-6;
}

drag
(
    (gas in liquid)
    {
        type            IshiiZuber;

        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (gas in liquid)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer.gas
(
    (gas in liquid)
    {
        type constantNu;
        Nu  1e1;
        residualAlpha 1e-4;
    }
);

heatTransfer.liquid
(
    (gas in liquid)
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }
);

lift
(
    (gas in liquid)
    {
        type wallDamped;

        lift
        {
            type Tomiyama;
            Cl 0.288;
        }

        wallDamping
        {
            type    cosine;
            Cd      1.0;
            zeroWallDist 0.0002;
        }
    }
);

wallLubrication
(
   (gas in liquid)
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
);

turbulentDispersion
(
    (gas in liquid)
    {
        type                LopezDeBertodano;
        Ctd                 1.0;
        residualAlpha       1e-3;
    }
);

blending
{
    default
    {
        type            none;
        continuousPhase liquid;
    }
}

aspectRatio
();

saturation
(
    (gas and liquid)
    {
        type function1;

        function scale;
        functionCoeffs
        {
            xScale 1e-6;
            scale   1;
            value
            {
                type                tableFile;
                format              csv;
                nHeaderLine         1;
                refColumn           1;
                componentColumns    (0);
                separator           ";";
                mergeSeparators     no;
                file                "R12.csv";
                outOfBounds         clamp;
                interpolationScheme linear;
            }
        };
    }
);

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.00176574;
    }
);

phaseTransfer
();

interfaceCompression
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
